-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 17, 2021 at 08:04 AM
-- Server version: 10.1.41-MariaDB
-- PHP Version: 7.2.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `admin_ssrq`
--

-- --------------------------------------------------------

--
-- Table structure for table `quiz`
--

CREATE TABLE `quiz` (
  `qiuizID` int(11) NOT NULL,
  `Indicators` int(11) NOT NULL,
  `Indicators_sub` int(11) NOT NULL,
  `question_number` int(11) NOT NULL,
  `question` varchar(255) NOT NULL,
  `answer1` varchar(255) NOT NULL,
  `answer_fee1` int(11) NOT NULL,
  `answer2` varchar(255) NOT NULL,
  `answer_fee2` int(11) NOT NULL,
  `answer3` varchar(255) NOT NULL,
  `answer_fee3` int(11) NOT NULL,
  `answer4` varchar(255) NOT NULL,
  `answer_fee4` int(11) NOT NULL,
  `total` int(11) NOT NULL,
  `total1` int(11) NOT NULL,
  `total2` int(11) NOT NULL,
  `total3` int(11) NOT NULL,
  `total4` int(11) NOT NULL,
  `total5` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `quiz`
--

INSERT INTO `quiz` (`qiuizID`, `Indicators`, `Indicators_sub`, `question_number`, `question`, `answer1`, `answer_fee1`, `answer2`, `answer_fee2`, `answer3`, `answer_fee3`, `answer4`, `answer_fee4`, `total`, `total1`, `total2`, `total3`, `total4`, `total5`) VALUES
(1, 1, 1, 1, 'ในขณะที่ครูกำลังสอน สุภาวดีไม่เข้าใจที่ครูพูดเลยถึงแม้จะตั้งใจเรียนก็ตามแต่เพราะต้องการให้ได้คะแนนดีๆเพื่อจะได้ประสบความสำเร็จในอนาคต ถ้านักเรียนเป็นสุภาวดีจะทำอย่างไร', 'ขอให้ครูช่วยอธิบายให้ใหม่อีกครั้ง', 4, 'ไม่เป็นไรแล้วค่อยลอกการบ้านเพื่อน ', 1, 'ไม่กล้าถามครูแต่จะขอให้เพื่อนอธิบายให้', 2, 'จดจ่อในเรื่องที่เรียนแม้นว่าจะไม่เข้าใจเรื่องที่ครูกำลังสอน ', 3, 0, 0, 0, 0, 0, 0),
(2, 1, 1, 2, 'เวลาที่ครูสอนและให้คิดตามไปด้วย สุวิชามักจะไม่คิดตามเพราะมัวแต่คิดเรื่องอื่น ถ้านักเรียนเป็นสุวิชาจะทำอย่างไร', 'ไม่สามารถคิดตามได้เพราะเรื่องที่เรียนยากเกินไป  ', 2, 'ไม่สามารถคิดตามได้เพราะมีเรื่องอื่นที่ต้องคิด', 1, 'คิดตามไปด้วยแต่อาจจะคิดเรื่องอื่นในขณะเดียวกัน', 3, 'พยายามคิดตามและทำความเข้าใจในสิ่งที่ครูกำลังสอน', 4, 0, 0, 0, 0, 0, 0),
(3, 1, 1, 3, 'สมปองเห็นเพื่อนๆดื่มเครื่องดื่มที่มีแอลกอฮอล์อย่างมีความสุขคุยกันอย่างสนุกสนานอยากเข้าร่วมด้วยแต่ก็รู้ว่าเป็นสิ่งที่ไม่ดีถ้านักเรียนเป็นสมปองจะทำอย่างไร', 'ไปดื่มเต็มที่กับเพื่อน ', 1, 'ดื่มนิดหน่อย แล้วขอดื่มเครื่องดื่มแทน', 3, 'ปฏิเสธเพื่อนพร้อมต่อว่าเพื่อน ', 2, 'ปฏิเสธอย่างสุภาพแล้วขอดื่มเครื่องดื่มอื่นแทน ', 4, 0, 0, 0, 0, 0, 0),
(4, 1, 1, 4, 'วันนี้อภิชัยต้องไปเรียนพิเศษวิชาคณิตศาสตร์และอภิชัยรู้สึกเบื่อมาก ไกรฤกษ์เลยชวนอภิชัยไปแอบเล่นการพนันกับเพื่อนอีก 3 คน ถ้านักเรียนเป็นอภิชัยจะทำอย่างไร', 'ไปกับเพื่อนเพราะขัดเพื่อนไม่ได้แต่ไม่เล่น ', 2, 'ไม่ไปเล่นการพนันกับเพื่อนเพราะไม่ชอบและรู้ว่ามันเป็นสิ่งที่ไม่ดี ', 4, 'ไปเล่นการพนันกับเพื่อนแก้เซ็งทั้งๆที่รู้ว่ามันไม่ดี ', 1, 'ไม่ไปเล่นการพนันกับเพื่อนเพราะกลัวแม่ดุและรู้ว่ามันเป็นสิ่งที่ไม่ดี ', 3, 0, 0, 0, 0, 0, 0),
(5, 1, 1, 5, 'ในวันเสาร์ขณะที่วิภาดากำลังทำโครงงานคุณธรรมอยู่นั้น มาลีวัลย์มาชวนไปเที่ยวห้างสรรพสินค้า ถ้านักเรียนเป็นวิภาดานักเรียนจะทำอย่างไร', 'ทำงานให้เสร็จก่อนแล้วค่อยขอผู้ปกครองไปเที่ยวห้างกับมาลีวัลย์ ', 4, 'เก็บงานไว้ทำวันหลังแล้วไปเที่ยวห้างสรรพสินค้ากับมาลีวัลย์ ', 1, 'ขออนุญาตผู้ปกครองก่อนไปเที่ยวห้างสรรพสินค้ากับมาลีวัลย์แล้วค่อยกลับมาทำงานส่ง ', 2, 'ไม่ไปเที่ยวห้างสรรพสินค้ากับมาลีวัลย์เพราะต้องทำงานให้เสร็จ ', 3, 0, 0, 0, 0, 0, 0),
(6, 1, 1, 6, 'อาจารย์ฝ่ายกีฬามองเห็นว่า เกียรติศักดิ์สามารถเป็นตัวแทนนักกีฬาของโรงเรียนได้ เขาจึงพยายามฝึกซ้อมอย่างหนัก แต่เมื่อไปแข่งขันแล้วพ่ายแพ้กลับมา ถ้านักเรียนเป็นเกียรติศักดิ์จะทำอย่างไร', 'พยายามฝึกซ้อมกีฬานั้นต่อไปอย่างสม่ำเสมอ ', 4, 'เปลี่ยนไปสนใจกิจกรรมอื่นๆที่เราต้องการแทน ', 1, 'กลับมาซ้อมบ้างบางเวลา ', 2, 'กลับมาซ้อมเพิ่มเพราะอาจารย์บอกว่าครั้งหน้าจะส่งเราไปแข่งขันอีก ', 3, 0, 0, 0, 0, 0, 0),
(7, 1, 1, 7, 'ครูสุวรรณลาตำหนิพงศกรว่าไม่ทำเวรทำความสะอาดห้องเรียนและลงโทษให้พงศกรทำความสะอาดห้องเรียนทุกวันเป็นเวลา 1 สัปดาห์ถ้านักเรียนเป็นพงศกรจะทำอย่างไรเมื่อเห็นว่าตนเองได้ทำเวรแล้ว', 'พูดชี้แจงด้วยน้ำเสียงปกติ ', 4, 'นิ่งเฉยทำเป็นไม่ค่อยสนใจฟัง ', 2, 'พูดโต้ตอบทันทีเพื่อให้ครูรู้ว่าไม่พอใจ ', 1, 'พูดโต้ตอบทันทีเพื่อให้ครูรู้ว่าไม่พอใจแต่ยินยอมทำ ', 3, 0, 0, 0, 0, 0, 0),
(8, 1, 1, 8, 'กานดานัดกับสุพรทิพย์ว่าจะไปเที่ยวห้างกันในวันเสาร์แต่พอถึงวันนัดหมายในตอนเช้ากานดาโทรศัพท์ไปหาสุพรทิพย์และได้คำตอบว่าสุพรทิพย์ไม่อยากไปแล้วถ้านักเรียนเป็นกานดาจะเลือกทำข้อใดต่อไปนี้', 'พูดโว้ยวายเสียงดังเพื่อให้สุพรทิพย์ไปด้วยให้ได้  ', 2, 'พูดประชดว่าไม่เป็นไรด้วยน้ำเสียงที่ไม่พอใจ  ', 3, 'ถามเหตุผลว่าของสุพรทิพย์ก่อนว่าทำไมไม่ไป  ', 4, 'โมโหและต่อว่าสุพรทิพย์ว่าเป็นคนกลับกลอก', 1, 0, 0, 0, 0, 0, 0),
(9, 1, 2, 9, 'วลัยพรทำการบ้านยังไม่เสร็จเพราะไม่เข้าใจ จึงขอให้สัตนันท์ช่วยอธิบาย โดยสัตนันท์สัญญาว่าจะช่วยแต่ปรากฏว่าสัตนันท์ไม่ว่างจึงยังไม่ได้ช่วยทำ ถ้านักเรียนเป็นวลัยพรจะทำอย่างไร', 'ขอให้ช่วยทำหลังเลิกเรียน ', 4, 'ขู่สัตนันท์ว่าถ้าไม่ช่วยจะเลิกคบกัน ', 1, 'ถามสัตนันท์ด้วยสีหน้าไม่พอใจว่าจะช่วยหรือไม่หากไม่ช่วยจะหาเพื่อนคนอื่นให้ช่วย ', 2, 'ถามสัตนันท์ด้วยสีหน้าปกติว่าจะช่วยหรือไม่และจะว่างช่วยตอนไหน ถ้าไม่ว่างจริงๆจะได้ไปถามเพื่อนคนอื่น ', 3, 0, 0, 0, 0, 0, 0),
(10, 1, 2, 10, 'ขวัญใจย้ายโรงเรียนบ่อยเนื่องจากคุณพ่อเป็นข้าราชการจึงจำเป็นต้องย้ายโรงเรียนเพื่อติดตามพ่อ ถ้านักเรียนเป็นขวัญใจต้องย้ายโรงเรียนบ่อยนักเรียนจะทำอย่างไร', 'เสียใจที่ต้องจากเพื่อนสนิทโรงเรียนเดิมแต่ก็ต้องย้ายตามผู้ปกครอง ', 3, 'ขอผู้ปกครองไม่ย้ายไปด้วยขออยู่หอพักเพราะไม่อยากจากเพื่อนที่โรงเรียนเดิม ', 2, 'คิดว่าการพบเพื่อนใหม่เป็นประสบการณ์ที่ดีชินกับการย้ายโรงเรียนแล้ว ', 4, 'รู้สึกกังวลทุกครั้งในการเข้าเรียนโรงเรียนใหม่และพบเพื่อนใหม่ ', 1, 0, 0, 0, 0, 0, 0),
(11, 2, 2, 11, 'ถ้าเพื่อนบ้านนักเรียนปลูกต้นไม้ไว้ข้างบ้านแล้วต้นไม้ใหญ่ยืนกิ่งไม้เข้ามาในบ้านนักเรียนทำให้บดบังทัศนียภาพและอาจหักโค่นลงมาใส่บ้านนักเรียนได้ในสถานการณ์เช่นนี้นักเรียนจะทำอย่างไร', 'อยู่เฉยๆไม่กล้าไปแจ้งเพราะกลัวทะเลาะกับเพื่อนบ้าน ', 1, 'อยู่เฉยๆรอให้เกิดเหตุการณ์ต้นไม้หักใส่บ้านเราก่อนค่อยไปคุยกับเพื่อนบ้าน ', 2, 'เดินเข้าไปคุยกับเพื่อนบ้านแล้วบอกกล่าวถึงผลกระทบที่เกิดจากบ้านเราให้เพื่อนบ้านฟัง ', 4, 'เดินเข้าไปบอกให้เพื่อนบ้านตัดต้นไม้ถ้าไม่ทำจะบอกผู้ปกครองให้ขอใช้สิทธิดำเนินการทางกฎหมาย ', 3, 0, 0, 0, 0, 0, 0),
(12, 2, 2, 12, 'อาจารย์ให้จับกลุ่มแสดงละครเวทีในงานวันสุนทรภู่ เพื่อนในกลุ่มให้ช่วยกันแสดงความคิดเห็นเพื่อนในกลุ่มคนหนึ่งเสนอว่าให้แสดงละครเรื่องโรมิโอกับจูเลียต นักเรียนไม่เห็นด้วยในสถานการณ์เช่นนี้นักเรียนจะทำอย่างไร', 'อยู่เฉยๆไม่กล้าคัดค้านเพื่อน ', 1, 'อยู่เฉยๆไม่กล้าคัดค้านแต่ถ้ามีเพื่อนคนไหนเสนอว่าไม่เห็นด้วยค่อยยกมือสนับสนุนเพื่อนคนนั้น', 2, 'บอกเพื่อนว่าไม่เห็นด้วยเพราะมันไม่ใช่วรรณคดีของไทย ', 3, 'บอกเพื่อนว่าไม่เห็นด้วยเพราะไม่ใช่วรรณกรรมที่แต่งโดยสุนทรภู่และเสนอแนะวรรณกรรมที่สุนทรภู่เคยแต่งไว้ ', 4, 0, 0, 0, 0, 0, 0),
(13, 2, 2, 13, 'โรงเรียนปิดประกาศรับสมัครสอบชิงทุนการศึกษาไปเรียนคอร์สภาษาอังกฤษระยะสั้นที่ประเทศสิงคโปร์เป็นเวลา 1 เดือนปรากฏว่านักเรียนและเพื่อนสนิทสอบได้เป็นตัวแทนโรงเรียนไปเรียนต่างประเทศต่อมาเพื่อนสนิทของนักเรียนไปไม่ได้เพราะป่วยทำให้นักเรียนต้องไปต่างประเทศคนเดียว ', 'ไม่กล้าไปคนเดียวขอถอนการรับทุน ', 1, 'รู้สึกกลัวที่จะไปต่างประเทศคนเดียวแต่ก็ต้องไปเพราะได้ทุนแล้ว ', 2, 'รู้สึกตื่นเต้นและอยากไปพบกับเพื่อนใหม่และประสบการณ์ใหม่ที่ต่างประเทศ ', 3, 'รู้สึกตื่นเต้นและตั้งใจกับการเรียนภาษาอังกฤษมากพร้อมรับกับสถานการณ์ที่จะเกิดขึ้น ', 4, 0, 0, 0, 0, 0, 0),
(14, 2, 2, 14, 'วันพรุ่งนี้ครูให้นักเรียนสำรวจรายชื่อคนที่จะไปเข้าค่ายอาสาพัฒนาและให้ส่งรายชื่อให้ครูในตอนเช้าวันรุ่งขึ้นเพื่อนคนหนึ่งในห้องไม่มาโรงเรียนนักเรียนจะทำอย่างไร', 'รอถามเพื่อนก่อน ', 4, 'ตัดสินใจแทนเพื่อน ', 2, 'ส่งรายชื่อให้ครูเท่าที่สำรวจได้ ', 3, 'ไม่สนใจเพื่อนตัดรายชื่อออก ', 1, 0, 0, 0, 0, 0, 0),
(15, 2, 2, 15, 'นักเรียนกำลังทำการบ้านแล้วพ่อใช้ให้ไปรดน้ำต้นไม้นักเรียนจะทำอย่างไร เพราะอะไร', 'พ่อไม่เข้าใจพ่อทำอย่างนี้ได้อย่างไรเสียความรู้สึก ', 1, 'ไปรดน้ำต้นไม้แล้วให้พ่อทำการบ้านให้เพราะจะได้ไม่เสียดุล ', 2, 'ขอทำการบ้านก่อนเพราะการเรียนสำคัญแล้วค่อยไปรดน้ำต้นไม้ ', 4, 'ไปรดน้ำต้นไม้ก่อนเพราะเดี๋ยวจะหาว่าไม่เชื่อฟังพ่อแม่ ', 3, 0, 0, 0, 0, 0, 0),
(16, 2, 2, 16, 'ขณะนี้มีโรคระบาดโควิท 19 เกิดขึ้นรัฐบาลประกาศให้มีการรักษาระยะห่างทางสังคมและสวมหน้ากากอนามัยป้องกันโรค นักเรียนได้ทำตามนโยบายของรัฐบาลอย่างไร', 'ไม่ใส่หน้ากากและนั่งทานอาหารใกล้กับเพื่อนตามปกติเพราะเชื่อว่าไม่มีโรคในประเทศไทยแล้ว ', 1, 'ใส่หน้ากากเฉพาะตอนเข้าห้างสรรพสินค้าเพราะเขาบังคับ', 3, 'ใส่หน้ากาก ล้างมือบ่อยๆและเว้นระยะห่างตามรัฐบาลแนะนำอย่างเคร่งครัดทุกครั้งที่ออกนอกบ้าน ', 4, 'ใส่หน้ากากไว้ใต้คาง เวลาจะเข้าห้างค่อยดึงขึ้นมาปิดเพราะใส่แล้วหายใจไม่สะดวก ', 2, 0, 0, 0, 0, 0, 0),
(17, 2, 2, 17, 'นัทมีเพื่อนในห้องมาจีบ แต่นัทไม่ได้ชอบเพื่อนคนนั้น ถ้านักเรียนเป็นนัทบอกเพื่อนที่มาจีบว่าอย่างไร', 'บอกว่าไม่ชอบและอย่ามายุ่งกับตนอีก ', 1, 'บอกว่าตอนนี้ยังเป็นนักเรียนอยู่เป็นเพื่อนกันไปก่อน ', 4, 'บอกว่าไม่อยากมีแฟนเดี๋ยวโดนเพื่อนล้อ ', 3, 'บอกว่าไม่ชอบรอเธอรวยก่อนค่อยมาจีบใหม่ ', 2, 0, 0, 0, 0, 0, 0),
(18, 2, 2, 18, 'อนุพงษ์เป็นสมาชิกชมรมอาสาพัฒนาชนบท ได้ออกไปตั้งค่ายพัฒนาชนบทแห่งหนึ่ง โดยร่วมทำงานกับเพื่อนๆหลายคน ซึ่งต่างก็ยังไม่เคยทำงานร่วมกันมาก่อน ในสถานการณ์เช่นนี้ ถ้านักเรียนเป็นอนุพงษ์จะทำอย่างไร', 'ควรประชุมปรึกษาหารือกันก่อนเพื่อวางแผนและแบ่งความรับผิดชอบในการทำงาน ', 4, 'ตอนทำงานไม่ค่อยอยากทำ รอร่วมสนุกในงานเลี้ยงกลางคืนอย่างเดียว ', 1, 'รอดูสถานการณ์ไปก่อน จนกว่าเพื่อนๆจะบอกให้ช่วยทำอะไร ', 3, 'จับกลุ่มเฉพาะเพื่อนที่สนิทและทำเฉพาะงานที่ตัวเองพอใจ ', 2, 0, 0, 0, 0, 0, 0),
(19, 2, 3, 19, 'ในวิชาแนะแนวครูให้นักเรียนเขียนเรียงความเรื่องอาชีพในฝันของฉัน นักเรียนมีวิธีการเขียนเรียงความอย่างไร', 'เขียนส่งๆไปโดยไม่วางแผนขอแค่ให้มีส่ง  ', 1, 'ดูของเพื่อนเป็นตัวอย่างแล้วเขียนตามเพื่อน ', 2, 'นำเสนอเนื้อหาเป็นลำดับขั้นตอนโดยออกแบบการนําเสนอให้น่าสนใจ ', 4, 'นำเสนอเนื้อหาเป็นลำดับขั้นตอน ตามหัวข้อที่ครูให้มา ', 3, 0, 0, 0, 0, 0, 0),
(20, 2, 3, 20, 'ในการเลือกหัวหน้าห้องตูมตามได้รับการเสนอชื่อและได้รับเลือกให้เป็นหัวหน้าห้องถ้านักเรียนเป็นตูมตามจะทำอย่างไร', 'ไม่รับตำแหน่งเพราะคิดว่าตนเองไม่มีความสามารถ ', 2, 'ไม่รับตำแหน่งเพราะกลัวเพื่อนในห้องใช้งาน ', 1, 'รับตำแหน่งเพราะเชื่อว่าตนเองมีความสามารถเป็นหัวหน้าห้องที่ดีได้ ', 4, 'รับตำแหน่งแต่ไม่มั่นใจว่าตัวเองจะเป็นหัวหน้าห้องที่ดีได้หรือไม่ ', 3, 0, 0, 0, 0, 0, 0),
(21, 2, 3, 21, 'เมื่อความคิดเห็นไม่ตรงกับผู้อื่นนักเรียนจะปฏิบัติอย่างไร', 'ไม่เห็นด้วยในเรื่องใดจะชี้แจงให้คนอื่นเห็นด้วยกับเหตุผลของตนเอง ', 1, 'ยินดีรับฟังเหตุผลของคนอื่นแม้จะไม่เห็นด้วยก็ตาม ', 2, 'ยินดีรับฟังเหตุผลของคนอื่นแม้จะไม่เห็นด้วยและจะพยายามอธิบายเหตุผลของตนเองให้คนอื่นฟังเมื่อมีโอกาส ', 3, 'ยินดีรับฟังเหตุผลของคนอื่นแม้จะไม่เห็นด้วยจะพยายามอธิบายเหตุผลของตัวเองให้คนอื่นฟังเมื่อมีโอกาสและยอมรับในเหตุผลของคนส่วนใหญ่ ', 4, 0, 0, 0, 0, 0, 0),
(22, 2, 3, 22, 'พ่อแม่อยากให้นักเรียนเลือกอาชีพเป็นข้าราชการเพราะเป็นอาชีพที่มั่นคงเมื่อเกษียณอายุแล้วจะได้มีเงินเลี้ยงชีพตลอดชีวิตแต่นักเรียนไม่ชอบนักเรียนชอบการค้าขายเมื่อนักเรียนได้เลือกการค้าขายแต่ปรากฏว่าทำไป 2 ธุรกิจแล้วขาดทุนนักเรียนรู้สึกอย่างไร', 'น่าจะเลือกเรียนตามที่พ่อแม่บอกก็ดี ', 1, 'ไม่เป็นไรค่อยหาอาชีพใหม่ต่อไป ', 3, 'ท้อแท้เสียใจแต่ค้าขายต่อไปเผื่อมีโอกาสทางธุรกิจอื่น ', 3, 'ไม่เสียใจเพราะเป็นสิ่งที่เราชอบอย่างน้อยก็ได้ลองทำ ', 4, 0, 0, 0, 0, 0, 0),
(23, 3, 3, 23, 'มาริสาเป็นนักเรียนชั้นมัธยมศึกษาปีที่ 6 ปีนี้ต้องเตรียมตัวสอบให้พร้อมที่สุดเพื่อจะได้เรียนในคณะที่ตนสนใจถ้านักเรียนเป็นมาริสาจะทำอย่างไร', 'ตั้งใจอ่านหนังสืออย่างเต็มความสามารถ ', 4, 'ปรึกษาหารือกับพ่อแม่ผู้ปกครองและขอเงินสนับสนุนเพื่อไปเรียนพิเศษในรายวิชาที่ใช้สอบ ', 3, 'ไม่ต้องปรึกษาหารือใครแต่ทำในสิ่งที่ตนเองต้องการ ', 2, 'ไม่ต้องไปโรงเรียนแต่ขอลาหยุดเพื่อเตรียมตัวสอบ ', 1, 0, 0, 0, 0, 0, 0),
(24, 3, 3, 24, 'ครูสั่งให้การะเกดนำวัสดุอุปกรณ์มาใช้ในการทดลองวิทยาศาสตร์ในชั่วโมงหน้าแต่เมื่อการะเกดสำรวจแล้วยังขาดวัสดุอุปกรณ์บางอย่างถ้านักเรียนเป็นการะเกดจะทำอย่างไร', 'จัดเตรียมวัสดุอุปกรณ์ที่ต้องใช้ให้เรียบร้อย ', 4, 'จัดเตรียมเท่าที่หาได้ถ้าหาไม่ครบค่อยให้พ่อแม่และพี่สาวหาให้ ', 3, 'ไม่จัดวัสดุอุปกรณ์อะไรเลยไปขอยืมเพื่อนในชั่วโมงเรียน ', 2, 'ไม่จัดวัสดุอุปกรณ์อะไรเลยเพราะคิดว่าเป็นหน้าที่ของครู ', 1, 0, 0, 0, 0, 0, 0),
(25, 3, 3, 25, 'ดวงสมรวาดฝันไว้ว่าโตขึ้นจะเป็นสถาปนิกเหมือนอรอนงค์ลูกสาวของป้าไพ  พ่อแม่ของดวงสมรสนับสนุนอย่างเต็มที่เกี่ยวกับการเรียน ดวงสมรจึงตั้งใจเรียนและอ่านหนังสือเมื่อมีเวลาว่าง  ป้าไพแนะนำให้ยืมหนังสือเตรียมสอบและให้อรอนงค์ติวให้ถ้านักเรียนเป็นดวงสมรจะคิดอย่างไร', 'ไม่สนใจเพราะเก่งอยู่แล้ว ', 1, 'ไม่สนใจเพราะไม่เชื่อในอรอนงค์ ', 2, 'สนใจเพราะเชื่อว่าจะมีแนวข้อสอบ ', 3, 'สนใจเพราะเชื่อว่าอรอนงค์จะทำให้ความฝันของตนเป็นจริง ', 4, 0, 0, 0, 0, 0, 0),
(26, 3, 3, 26, 'ณัฐวุฒิเก่งมากในวิชาภาษาอังกฤษและคณิตศาสตร์ ครูและเพื่อนๆในชั้นเรียนต่างก็ชื่นชมนอกจากเรียนเก่งแล้วณัฐวุฒิยังเป็นนักเรียนที่มีความเสียสละโดยหลังเลิกเรียนทุกวันพุธจะช่วยสอนพิเศษให้เพื่อนๆที่ไม่เข้าใจในบทเรียนถ้านักเรียนเป็นเพื่อนของณัฐวุฒินักเรียนจะคิดอย่า', 'น่าสนใจแต่ไม่ไปเรียนกับณัฐวุฒิเพราะตนเองเก่งแล้ว ', 3, 'สนใจและไปสมัครเรียนกับณัฐวุฒิหลังเลิกเรียน ', 4, 'ไม่สนใจและไม่ไปเรียนกับณัฐวุฒิ ', 1, 'เฉยๆ เพราะแค่เรียนในห้องก็เบื่อแล้ว ', 2, 0, 0, 0, 0, 0, 0),
(27, 3, 3, 27, 'ที่หมู่บ้านของโชคชัยมีการจัดกิจกรรมทำความสะอาดบริเวณถนนรอบหมู่บ้านทุกวันพระ โดยมีการประกาศเชิญชวนเสียงตามสายของหอกระจายข่าวประจำหมู่บ้านก่อนล่วงหน้า 1 วันทุกครั้งถ้านักเรียนเป็นโชคชัยนักเรียนจะทำอย่างไร', 'เฉยๆไม่สนใจ ', 1, 'สนใจเพราะเป็นสิ่งดีงามแต่ไม่อยากทำ ', 2, 'สนใจเพราะเป็นสิ่งดีงามและจัดเตรียมอุปกรณ์ให้พร้อม ', 3, 'สนใจร่วมวางแผนแบ่งหน้าที่กันทำงานช่วยเหลืองานจนสำเร็จ ', 4, 0, 0, 0, 0, 0, 0),
(28, 3, 3, 28, 'ในชั่วโมงว่างของประสิทธิ์ได้สืบค้นข้อมูลเกี่ยวกับการทำโครงงานคุณธรรมเฉลิมพระเกียรติจากอินเทอร์เน็ตแต่ปรากฏว่าหมดเวลาก่อนจึงคิดว่าหลังเลิกเรียนจะนำความรู้เรื่องการทำโครงการคุณธรรมไปแนะนำและชวนเพื่อนทำโครงงานกันถ้านักเรียนเป็นเพื่อนของประสิทธิ์นักเรียนคิดอย', 'สนใจแต่ร่วมทำโครงงานไม่ได้เพราะต้องช่วยพ่อแม่ทำงาน  ', 2, 'เฉยๆไม่สนใจ ', 1, 'สนใจทักชวนเพื่อนๆคุยเรื่องนี้ทุกวัน ', 3, 'สนใจทักชวนเพื่อนๆและขอคำปรึกษาจากครูเพื่อวางแผนการทำงาน', 4, 0, 0, 0, 0, 0, 0),
(29, 3, 3, 29, 'ในวันที่นักเรียนมีเวลาว่างไม่ได้ไปโรงเรียนและไม่ได้ช่วยผู้ปกครองทำงานนักเรียนทำอะไร', 'นอน', 2, 'ชวนเพื่อนเที่ยวและไปหาของอร่อยทาน ', 3, 'หากิจกรรมเสริมพัฒนาการทำเช่น เล่นกีฬา เล่นดนตรี ', 4, 'จับกลุ่มกินเหล้า ร้องเพลง ', 1, 0, 0, 0, 0, 0, 0),
(30, 3, 3, 30, 'เรามักได้ยินประโยคที่ว่า “คนเราควรใช้เวลาว่างให้เกิดประโยชน์ในการพัฒนาตนเอง” จากประโยคนี้ถ้านักเรียนจะทำอะไร', 'ฉันรู้ว่าการอ่านหนังสือมีประโยชน์  ', 1, 'ฉันชอบอ่านหนังสือและรักการอ่าน ', 2, 'ฉันใช้เวลาว่างร่วมกิจกรรมกับครอบครัวมากกว่าดูทีวี/เล่นโซเซียลมีเดีย ', 3, 'ฉันอ่านหนังสือทุกวันเมื่อมีเวลา หลังจากช่วยเหลืองานบ้านและทำกิจกรรมร่วมในครอบครัว ', 4, 0, 0, 0, 0, 0, 0),
(31, 4, 4, 31, 'ดาวเรืองเรียนวิชาคณิตศาสตร์ไม่เก่ง ดาวเรืองค้นจึงคว้าหาความรู้เพิ่มเติมโดยการอ่านหนังสือและตั้งใจเรียนให้มากขึ้นแต่ผลการเรียนก็ไม่ดีขึ้นถ้านักเรียนเป็นดาวเรืองจะทำอย่างไร', 'เฉยๆไม่สนใจทำต่อไปอีก ', 1, 'ไม่ท้อแท้พยายามทำต่อไป ', 2, 'อดทนหาข้อบกพร่องของตัวเอง ', 3, 'ขยันเพิ่มขึ้นและแก้ไขข้อบกพร่องของตนเอง ', 4, 0, 0, 0, 0, 0, 0),
(32, 4, 4, 32, '“คนเรา...ถ้าค้นพบจุดเด่นของตนที่พัฒนาได้...ก็จะมีผลงานที่ดีที่สุด” จากข้อความนี้นักเรียนคิดหรืออยากทำสิ่งใด', 'เฉยๆไม่รู้สึกอะไร ', 2, 'ไม่อยากทำอะไรเพราะขี้เกียจ ', 1, 'ทำอะไรสักอย่างที่ตนทำได้ ', 3, 'ทำอะไรสักอย่างที่ตนทำได้ดีและบ่งบอกถึงความสามารถของตนเอง ', 4, 0, 0, 0, 0, 0, 0),
(33, 4, 4, 33, 'คุณครูมอบหมายให้แนนซี่ทำกิจกรรมกลุ่มแกะสลักผักและผลไม้แกะสลักแตงโมให้เสร็จและเก็บอุปกรณ์ให้เรียบร้อย ถ้านักเรียนเป็นสมาชิกกลุ่มของแนนซี่ นักเรียนจะทำอย่างไร', 'ไม่สนใจช่วยเพื่อน', 2, 'ไม่สนใจแล้วชวนเพื่อนไปเล่น ', 1, 'ช่วยกันทำงานและเก็บอุปกรณ์ให้ทันเวลา ', 3, 'แบ่งหน้าที่กันทำงานและช่วยกันทำงานให้สำเร็จทันเวลา ', 4, 0, 0, 0, 0, 0, 0),
(34, 4, 4, 34, 'คุณครูมอบหมายงานให้นักเรียนทำชิ้นหนึ่งที่ค่อนข้างยากและต้องทักษะหลายอย่างในการทำงานจึงจะสำเร็จลุล่วงและส่งทันตามเวลาที่กำหนดในการทำงานลักษณะนี้ นักเรียนจะทำอย่างไร', 'ต้องศึกษาค้นคว้าทดลองทำอย่างเต็มที่ ', 3, 'นำงานนั้นไปจ้างคนอื่นทำ จะได้ไม้เสียเวลาทำในสิ่งที่ตนเองไม่ถนัด ', 1, 'วางแผนเพื่อกำหนดการทำงาน ค้นคว้าและลงมือทำ ', 4, 'หาเพื่อมาช่วยเพื่อให้ทำงานให้เสร็จจะได้ส่งทันเวลา ', 2, 0, 0, 0, 0, 0, 0),
(35, 4, 4, 35, 'เมื่อครูที่สอนนักเรียนบอกว่านักเรียนเป็นคนใจร้อน ไม่ค่อยมีความรอบคอบในการทำงานหรือทำข้อสอบ นักเรียนรู้สึกอย่างไร', 'ไม่เชื่อคุณครูเพราะรู้สึกว่าตัวเองไม่ใช่คนใจร้อน ', 1, 'ไม่สนใจเพราะถึงจะเป็นคนใจร้อน ไม่รอบคอบก็ไม่ทำให้ใครเดือดร้อน ', 2, 'ฟังที่ครูบอกแต่ก็ไม่แก้ไขเหมือนเดิม ', 3, 'ฟังที่ครูบอกแล้วนำมาปรับปรุงแก้ไข ', 4, 0, 0, 0, 0, 0, 0),
(36, 4, 4, 36, 'เมื่อคนที่บ้านนักเรียน บอกว่านักเรียนเป็นคนขี้เกียจสันหลังยาว นักเรียนรู้สึกอย่างไร', 'ไม่สนใจ ', 1, 'คนที่บ้านพูดเกินไปฉันแค่นอนตื่นสายและไม่ค่อยอ่านหนังสือเท่านั้น ', 2, 'ฟังและมาสำรวจตนเองตามที่เขาพูดว่าใช่หรือไม่ ', 3, 'ฟังและนำมาสำรวจตนเอง หาทางปรับปรุงแก้ไข ', 4, 0, 0, 0, 0, 0, 0),
(37, 4, 4, 37, 'อีก 1 เดือนข้างหน้าจะถึงกำหนดเวลาสอบปลายภาคเรียน นักเรียนจะเตรียมตัวในการสอบอย่างไร', 'ฉันไม่เคยเตรียมตัวสอบเลย ', 1, 'อ่านหนังสือบ้างบางวิชา ', 2, 'จัดตารางอ่านหนังสือ แต่ก็ทำตามได้บ้างไม่ได้บ้าง ', 3, 'จัดตารางอ่านหนังสือ และพยายามอ่านให้ได้ตามตารางที่จัด ', 4, 0, 0, 0, 0, 0, 0),
(38, 4, 4, 38, 'วิชาประวัติศาสตร์ ครูอุมาพรได้สั่งให้นักเรียนเขียนประวัติของตัวเองแล้วส่งในชั่วโมง พลอยได้ทำงานเสร็จแล้วมาส่งคุณครู แต่คุณครูบอกว่างานไม่สมบูรณ์ ให้นำมาแก้ไขใหม่ ถ้านักเรียนเป็นพลอยจะทำอย่างไร', 'นำมาแก้ไขตามที่ครูแนะนำด้วยความเต็มใจ ', 4, 'นำมาแก้ไขตามที่ครูแนะนำจนครบ ', 3, 'นำมาแก้ไขเป็นบางส่วน ', 2, 'ไม่แก้ไขตามที่ครูบอกเพราะคิดว่าทำดีแล้ว ', 1, 0, 0, 0, 0, 0, 0),
(39, 5, 5, 39, 'น้ำตาลมีน้ำหนักตัวเกินเกณฑ์มากจึงต้องการลดน้ำหนักเพื่อจะเข้ารับการคัดเลือกเป็นเชียร์ลีดเดอร์ในเดือนหน้าถ้านักเรียนเป็นน้ำตาลจะทำอย่างไร', 'กินยาลดความอ้วนทั้งๆที่รู้ว่ามันไม่ดีแต่ลดไว ', 1, 'ลดอาหารและวางแผนออกกำลังกาย ', 4, 'อดอาหารไปเลยน้ำหนักจะได้ลดลงไว ', 2, 'ซื้ออาหารเสริมราคาแพงมาทานจากเงินเก็บของตนเอง ', 3, 0, 0, 0, 0, 0, 0),
(40, 5, 5, 40, 'อัลเบริต์ ไอน์สไตล์ กล่าวว่า “ถ้าผมมีเวลา 1 ชั่วโมงในการแก้ปัญหา ผมจะใช้เวลา 55 นาทีขบคิดเกี่ยวกับปัญหานั้นและใช้เวลา 5 นาทีหาวิธีแก้ปัญหา” จากประโยคที่กล่าวมาเวลาเกิดปัญหาขึ้นนักเรียนสามารถบอกปัญหาที่เกิดขึ้นกับตนเองได้เพียงใด', 'ทุกครั้งเวลาที่เกิดปัญหาฉันรู้ว่าต้นตอของปัญหาเกิดจากอะไร ', 3, 'บางครั้งก็บอกได้ บางครั้งก็บอกไม่ได้ ', 2, 'ฉันไม่สามารถบอกปัญหาทีเกิดขึ้นกับฉันได้เลยมันสับสนไปหมด ', 1, 'ทุกครั้งเวลาที่เกิดปัญหาฉันรู้ว่าต้นตอของปัญหาเกิดจากอะไรและฉันรู้วิธีในการแก้ปัญหานั้น ', 4, 0, 0, 0, 0, 0, 0),
(41, 5, 5, 41, 'ถ้านักเรียนลืมหนังสือเรียนวิชาภาษาไทยมาโรงเรียน นักเรียนควรแก้ปัญหาอย่างไรจึงจะเหมาะสมที่สุด', 'ไม่เข้าห้องเรียนเพื่อเรียนวิชานี้เพราะขี้เกียจอยู่แล้ว ', 1, 'ซื้อหนังสือเรียนเล่มใหม่เพิ่มอีก 1 เล่ม ', 2, 'บอกคุณครูและขอดูกับเพื่อนที่นั่งข้างๆ ', 4, 'ขออนุญาตคุณครูกลับไปเอาหนังสือเรียนที่บ้าน ', 3, 0, 0, 0, 0, 0, 0),
(42, 5, 5, 42, 'จากการตกลงกันในที่ประชุมสภานักเรียน เรื่องการจัดพิธีไหว้ครูประจำปีการศึกษานี้อย่างประหยัด นักเรียนได้รับมอบหมายให้เป็นหัวหน้ากลุ่มจัดทำพานดอกไม้-ธูปเทียน ที่จะใช้ในพิธีนักเรียนจะเตรียมงานอย่างไร', 'คุยกับเพื่อนในห้องให้รวบรวมเงินกันไปจ้างร้านดอกไม้จัดให้ ', 2, 'มอบให้เพื่อนผู้หญิงทำเพราะเป็นงานของผู้หญิง ', 1, 'ให้เพื่อนหาวัสดุ อุปกรณ์มาช่วยกันทำพอเป็นพิธีเพื่อให้มีในวันไหว้ครู ', 3, 'ให้เพื่อทุกคนนำอุปกรณ์ ดอกไม้ ธูปเทียนมารวมกัน เพื่อประดิษฐ์พานไหว้ครูตามวัสดุที่มี ', 4, 0, 0, 0, 0, 0, 0),
(43, 5, 5, 43, 'เมื่อนัดเพื่อนทำงานกลุ่มหรือไปทำกิจกรรมอื่นใดด้วยกันแล้วเพื่อนมาไม่เคยตรงเวลานักเรียนทำอย่างไร', 'เลิกคบเพื่อนคนนั้น ', 1, 'มาสายเหมือนเพื่อนจะได้มาเวลาตรงกัน ', 2, 'รู้ว่าเพื่อนจะมาสายเลยนัดเวลาไม่ตรงกับที่ตนเองมาเช่น เวลาจริงอยากนัด 9.30 น. แต่บอกให้เพื่อนมา 9.00 น. ', 3, 'คุยกับเพื่อนให้เข้าใจว่าถ้าเพื่อนมาช้าไม่ตรงเวลาจะเกิดผลเสียอย่างไรแล้วให้เพื่อนปรับปรุงตัว ', 4, 0, 0, 0, 0, 0, 0),
(44, 5, 5, 44, 'ถ้านักเรียนเคยทำให้พ่อแม่ ผู้ปกครองผิดหวัง จากพฤติกรรมใดๆ ของนักเรียน เช่น พูดโกหก , โดดเรียนไปเล่นเกม ,ติดการพนัน,สอบตก ฯลฯ ถ้าย้อนเวลากลับไปได้นักเรียนจะ...', 'ไม่แน่ใจว่าจะทำเหมือนเดิมหรือไม่ ', 1, 'ต้องดูสถานการณ์ ณ ขณะนั้น ', 2, 'ไม่ทำเหมือนเดิมแน่นอน ', 3, 'รู้ว่าสิ่งที่ทำเป็นสิ่งไม่ดีจะไม่ทำตั้งแต่เริ่มแรก ', 4, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `respon`
--

CREATE TABLE `respon` (
  `ResID` int(11) NOT NULL,
  `FullName` varchar(255) NOT NULL,
  `answer_fee1` int(11) DEFAULT NULL,
  `answer_fee2` int(11) DEFAULT NULL,
  `answer_fee3` int(11) DEFAULT NULL,
  `answer_fee4` int(11) DEFAULT NULL,
  `answer_fee5` int(11) DEFAULT NULL,
  `answer_fee6` int(11) DEFAULT NULL,
  `answer_fee7` int(11) DEFAULT NULL,
  `answer_fee8` int(11) DEFAULT NULL,
  `answer_fee9` int(11) DEFAULT NULL,
  `answer_fee10` int(11) DEFAULT NULL,
  `answer_fee11` int(11) DEFAULT NULL,
  `answer_fee12` int(11) DEFAULT NULL,
  `answer_fee13` int(11) DEFAULT NULL,
  `answer_fee14` int(11) DEFAULT NULL,
  `answer_fee15` int(11) DEFAULT NULL,
  `answer_fee16` int(11) DEFAULT NULL,
  `answer_fee17` int(11) DEFAULT NULL,
  `answer_fee18` int(11) DEFAULT NULL,
  `answer_fee19` int(11) DEFAULT NULL,
  `answer_fee20` int(11) DEFAULT NULL,
  `answer_fee21` int(11) DEFAULT NULL,
  `answer_fee22` int(11) DEFAULT NULL,
  `answer_fee23` int(11) DEFAULT NULL,
  `answer_fee24` int(11) DEFAULT NULL,
  `answer_fee25` int(11) DEFAULT NULL,
  `answer_fee26` int(11) DEFAULT NULL,
  `answer_fee27` int(11) DEFAULT NULL,
  `answer_fee28` int(11) DEFAULT NULL,
  `answer_fee29` int(11) DEFAULT NULL,
  `answer_fee30` int(11) DEFAULT NULL,
  `answer_fee31` int(11) DEFAULT NULL,
  `answer_fee32` int(11) DEFAULT NULL,
  `answer_fee33` int(11) DEFAULT NULL,
  `answer_fee34` int(11) DEFAULT NULL,
  `answer_fee35` int(11) DEFAULT NULL,
  `answer_fee36` int(11) DEFAULT NULL,
  `answer_fee37` int(11) DEFAULT NULL,
  `answer_fee38` int(11) DEFAULT NULL,
  `answer_fee39` int(11) DEFAULT NULL,
  `answer_fee40` int(11) NOT NULL,
  `answer_fee41` int(11) NOT NULL,
  `answer_fee42` int(11) NOT NULL,
  `answer_fee43` int(11) NOT NULL,
  `answer_fee44` int(11) NOT NULL,
  `total` int(11) NOT NULL,
  `total1` int(11) NOT NULL,
  `total2` int(11) NOT NULL,
  `total3` int(11) NOT NULL,
  `total4` int(11) NOT NULL,
  `total5` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `respon`
--

INSERT INTO `respon` (`ResID`, `FullName`, `answer_fee1`, `answer_fee2`, `answer_fee3`, `answer_fee4`, `answer_fee5`, `answer_fee6`, `answer_fee7`, `answer_fee8`, `answer_fee9`, `answer_fee10`, `answer_fee11`, `answer_fee12`, `answer_fee13`, `answer_fee14`, `answer_fee15`, `answer_fee16`, `answer_fee17`, `answer_fee18`, `answer_fee19`, `answer_fee20`, `answer_fee21`, `answer_fee22`, `answer_fee23`, `answer_fee24`, `answer_fee25`, `answer_fee26`, `answer_fee27`, `answer_fee28`, `answer_fee29`, `answer_fee30`, `answer_fee31`, `answer_fee32`, `answer_fee33`, `answer_fee34`, `answer_fee35`, `answer_fee36`, `answer_fee37`, `answer_fee38`, `answer_fee39`, `answer_fee40`, `answer_fee41`, `answer_fee42`, `answer_fee43`, `answer_fee44`, `total`, `total1`, `total2`, `total3`, `total4`, `total5`) VALUES
(1, 'ณภัทร  ใจเอ็นดู', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 3, 2, 4, 3, 3, 3, 106, 27, 27, 15, 19, 18),
(3, 'แป๋ว', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 3, 2, 3, 2, 4, 4, 137, 39, 35, 19, 26, 18),
(4, 'วรเทพ รัศมีเดือน', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2, 2, 4, 3, 4, 4, 123, 31, 33, 22, 18, 19),
(5, 'ชญาดา เลี่ยมไธสง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 2, 4, 4, 2, 1, 113, 27, 34, 17, 18, 17),
(6, 'มณีรัตน์ สุดชา', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 3, 3, 4, 141, 34, 38, 20, 27, 22),
(7, 'พฤหัส โพธรุกข์', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 3, 2, 3, 3, 4, 4, 146, 30, 41, 29, 27, 19),
(8, 'นางสาวณัฏฐณิชา เสนาเจริญ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2, 2, 4, 4, 3, 2, 128, 32, 36, 19, 24, 17),
(9, 'น.ส.อภิญญา​ อาสา​สู้​', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 3, 4, 4, 4, 3, 165, 38, 46, 27, 32, 22),
(10, 'นางสาว โชติกา บวรรุ่งเรืองกูล', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 1, 4, 4, 3, 3, 154, 38, 43, 26, 28, 19),
(11, 'นางสาวปรายฟ้า แต่งเมือง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 4, 2, 148, 38, 36, 25, 27, 22),
(12, 'สุชาครีย์ เพชรน้อย', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 3, 3, 4, 4, 4, 144, 36, 37, 24, 25, 22),
(13, 'กัลยรัตน์ เจริญศิลป์', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 4, 2, 172, 40, 48, 31, 31, 22),
(14, 'นาย ต้นแบบ เจนเขตกิจ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 3, 3, 169, 38, 46, 31, 32, 22),
(15, 'พนิดา ศรีสองคอน', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 3, 4, 4, 167, 36, 44, 32, 32, 23),
(16, 'พลฤทธิ์ ฤทธิ์รักษา', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 2, 4, 4, 4, 4, 135, 32, 36, 24, 21, 22),
(17, 'นาย ชนะพงษ์พันธ์ สวัสดิ์แวงควง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 2, 4, 2, 4, 2, 141, 35, 40, 25, 23, 18),
(18, 'รัตนาวลี ถาดวิจิตร', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 3, 4, 4, 169, 38, 45, 31, 32, 23),
(19, 'จรรยมณฑ์ กรองน้ำ', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 2, 4, 4, 3, 4, 151, 33, 40, 28, 29, 21),
(20, 'ปวีณา  เอกตแสง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 3, 4, 4, 3, 4, 165, 38, 43, 31, 31, 22),
(21, 'ญาณิฐา มาตวังเเสง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 2, 2, 138, 35, 38, 18, 27, 20),
(22, 'กรรณิการ์ แชเชือน', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 2, 4, 4, 3, 2, 128, 30, 33, 21, 25, 19),
(23, 'ปณชัย บุษดี เลขที่4', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 1, 4, 2, 2, 2, 151, 38, 42, 31, 25, 15),
(24, 'พัตรพิมล ภิรมย์ไกรภักดิ์', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 4, 4, 168, 36, 47, 30, 31, 24),
(25, 'กัลยาณี พงษ์สะพัง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 4, 4, 169, 36, 46, 31, 32, 24),
(26, 'สุพิชชา มีด้วง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 4, 4, 167, 40, 42, 31, 30, 24),
(27, 'นาย​บูรพา​ ก้านโคกสูง', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 2, 4, 4, 3, 3, 149, 39, 42, 25, 23, 20),
(28, 'หัสดินทร์ สาทมุณี', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2, 3, 4, 4, 4, 4, 151, 37, 41, 23, 29, 21),
(29, 'ปรมินทร์ ถนอมศักดิ์', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 3, 4, 2, 3, 4, 139, 30, 40, 23, 26, 20),
(30, 'นายวันชัย ชาตรี', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, 1, 2, 2, 3, 2, 142, 36, 38, 30, 27, 11),
(31, 'พิมพ์ชนก ชมภูน้อย', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 4, 4, 4, 4, 4, 160, 36, 41, 30, 29, 24),
(32, 'ปวริศร์ คุณประทุม', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, 3, 4, 2, 3, 2, 146, 29, 44, 27, 28, 18);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `quiz`
--
ALTER TABLE `quiz`
  ADD PRIMARY KEY (`qiuizID`);

--
-- Indexes for table `respon`
--
ALTER TABLE `respon`
  ADD PRIMARY KEY (`ResID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `quiz`
--
ALTER TABLE `quiz`
  MODIFY `qiuizID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT for table `respon`
--
ALTER TABLE `respon`
  MODIFY `ResID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
